ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_SD.cpp
    if (newState) {
        *reinterpret_cast<uint32_t*>(CLKCR_OFFSET) |= (newState << CLKEN_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(CLKCR_OFFSET) &= ~(newState << CLKEN_BitNumber);
    }
}

/**
  * @brief  Sets the power status of the controllerIndex.
  * @param  SDIO_PowerState: new state of the Power state.
  *          This parameter can be one of the following values:
  *            @arg SDIO_PowerState_OFF: SDMMC1 Power OFF
  *            @arg SDIO_PowerState_ON: SDMMC1 Power ON
  * @retval None
  */
void SDIO_SetPowerState(uint32_t SDIO_PowerState) {

    SDMMC1->POWER = SDIO_PowerState;
}

/**
  * @brief  Gets the power status of the controllerIndex.
  * @param  None
  * @retval Power status of the controllerIndex. The returned value can be one of the
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x02: Power UP
  *            - 0x03: Power ON
  */
uint32_t SDIO_GetPowerState(void) {
    return (SDMMC1->POWER & (~PWR_PWRCTRL_MASK));
}

/**
  * @}
  */

  /** @defgroup SDIO_Group2 Command path state machine (CPSM) management functions
   *  @brief   Command path state machine (CPSM) management functions
   *
  @verbatim
   ===============================================================================
                Command path state machine (CPSM) management functions
   ===============================================================================

    This section provide functions allowing to program and read the Command path
    state machine (CPSM).

  @endverbatim
    * @{
    */

    /**
      * @brief  Initializes the SDMMC1 Command according to the specified
      *         parameters in the SDIO_CmdInitStruct and send the command.
      * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitTypeDef
      *         structure that contains the configuration information for the SDMMC1
      *         command.
      * @retval None
      */
void SDIO_SendCommand(uint32_t argument, uint32_t cmdIndex, uint32_t response) {
    uint32_t tmpreg = 0;


    /*---------------------------- SDMMC1 ARG Configuration ------------------------*/
      /* Set the SDMMC1 Argument value */
    SDMMC1->ARG = argument;

    /*---------------------------- SDMMC1 CMD Configuration ------------------------*/
      /* Get the SDMMC1 CMD value */
    tmpreg = SDMMC1->CMD;
    /* Clear CMDINDEX, WAITRESP, WAITINT, WAITPEND, CPSMEN bits */
    tmpreg &= CMD_CLEAR_MASK;
    /* Set CMDINDEX bits according to SDIO_CmdIndex value */
    /* Set WAITRESP bits according to SDIO_Response value */
    /* Set WAITINT and WAITPEND bits according to SDIO_Wait value */
    /* Set CPSMEN bits according to SDIO_CPSM value */
    tmpreg |= cmdIndex | response | SDIO_Wait_No | SDIO_CPSM_Enable;

    /* Write to SDMMC1 CMD */
    SDMMC1->CMD = tmpreg;
}

/**
  * @brief  Returns command index of last command for which response received.
  * @param  None
  * @retval Returns the command index of the last command response received.
  */
uint8_t SDIO_GetCommandResponse(void) {
    return (uint8_t)(SDMMC1->RESPCMD);
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDIO_RESP: Specifies the SDMMC1 response register.
  *          This parameter can be one of the following values:
  *            @arg SDIO_RESP1: Response Register 1
  *            @arg SDIO_RESP2: Response Register 2
  *            @arg SDIO_RESP3: Response Register 3
  *            @arg SDIO_RESP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDIO_GetResponse(uint32_t SDIO_RESP) {
    uint32_t tmp = 0;

    tmp = SDIO_RESP_ADDR + SDIO_RESP;

    return (*(uint32_t *)tmp);
}

/**
  * @}
  */

  /** @defgroup SDIO_Group3 Data path state machine (DPSM) management functions
   *  @brief   Data path state machine (DPSM) management functions
   *
  @verbatim
   ===============================================================================
                Data path state machine (DPSM) management functions
   ===============================================================================

    This section provide functions allowing to program and read the Data path
    state machine (DPSM).

  @endverbatim
    * @{
    */

    /**
      * @brief  Initializes the SDMMC1 data path according to the specified
      *         parameters in the SDIO_DataInitStruct.
      * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitTypeDef structure
      *         that contains the configuration information for the SDMMC1 command.
      * @retval None
      */

void SDIO_DataConfig(uint32_t dataLength, uint32_t blockSize, uint32_t transferDir) {
    uint32_t tmpreg = 0;

    /*---------------------------- SDMMC1 DTIMER Configuration ---------------------*/
      /* Set the SDMMC1 Data TimeOut value */
    SDMMC1->DTIMER = SD_DATATIMEOUT;

    /*---------------------------- SDMMC1 DLEN Configuration -----------------------*/
      /* Set the SDMMC1 DataLength value */
    SDMMC1->DLEN = dataLength;

    /*---------------------------- SDMMC1 DCTRL Configuration ----------------------*/
      /* Get the SDMMC1 DCTRL value */
    tmpreg = SDMMC1->DCTRL;
    /* Clear DEN, DTMODE, DTDIR and DBCKSIZE bits */
    tmpreg &= DCTRL_CLEAR_MASK;
    /* Set DEN bit according to SDIO_DPSM value */
    /* Set DTMODE bit according to SDIO_TransferMode value */
    /* Set DTDIR bit according to SDIO_TransferDir value */
    /* Set DBCKSIZE bits according to SDIO_DataBlockSize value */
    tmpreg |= (uint32_t)blockSize | transferDir | SDIO_TransferMode_Block | SDIO_DPSM_Enable;

    /* Write to SDMMC1 DCTRL */
    SDMMC1->DCTRL = tmpreg;
}

/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  None
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDIO_GetDataCounter(void) {
    return SDMMC1->DCOUNT;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  None
  * @retval Data received
  */
uint32_t SDIO_ReadData(void) {
    return SDMMC1->FIFO;
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDIO_WriteData(uint32_t Data) {
    SDMMC1->FIFO = Data;
}

/**
  * @brief  Returns the number of words left to be written to or read from FIFO.
  * @param  None
  * @retval Remaining number of words.
  */
uint32_t SDIO_GetFIFOCount(void) {
    return SDMMC1->FIFOCNT;
}

/**
  * @}
  */

  /** @defgroup SDIO_Group4 SDMMC1 IO Cards mode management functions
   *  @brief   SDMMC1 IO Cards mode management functions
   *
  @verbatim
   ===============================================================================
                SDMMC1 IO Cards mode management functions
   ===============================================================================

