ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_SD.cpp
    This section provide functions allowing to program and read the SDMMC1 IO Cards.

  @endverbatim
    * @{
    */

    /**
      * @brief  Starts the SD I/O Read Wait operation.
      * @param  newState: new state of the Start SDMMC1 Read Wait operation.
      *         This parameter can be: true or false.
      * @retval None
      */
void SDIO_StartSDIOReadWait(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) |= (1 << RWSTART_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) &= ~(1 << RWSTART_BitNumber);
    }
}

/**
  * @brief  Stops the SD I/O Read Wait operation.
  * @param  newState: new state of the Stop SDMMC1 Read Wait operation.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_StopSDIOReadWait(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) |= (1 << RWSTOP_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) &= ~(1 << RWSTOP_BitNumber);
    }

}

/**
  * @brief  Sets one of the two options of inserting read wait interval.
  * @param  SDIO_ReadWaitMode: SD I/O Read Wait operation mode.
  *          This parameter can be:
  *            @arg SDIO_ReadWaitMode_CLK: Read Wait control by stopping SDIOCLK
  *            @arg SDIO_ReadWaitMode_DATA2: Read Wait control using SDIO_DATA2
  * @retval None
  */
void SDIO_SetSDIOReadWaitMode(uint32_t SDIO_ReadWaitMode) {
    if (SDIO_ReadWaitMode) {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) |= (1 << RWMOD_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) &= ~(1 << RWMOD_BitNumber);
    }
}

/**
  * @brief  Enables or disables the SD I/O Mode Operation.
  * @param  newState: new state of SDMMC1 specific operation.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_SetSDIOOperation(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) |= (1 << SDIOEN_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(DCTRL_OFFSET) &= ~(1 << SDIOEN_BitNumber);
    }
}

/**
  * @brief  Enables or disables the SD I/O Mode suspend command sending.
  * @param  newState: new state of the SD I/O Mode suspend command.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_SendSDIOSuspendCmd(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) |= (1 << SDIOSUSPEND_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) &= ~(1 << SDIOSUSPEND_BitNumber);
    }
}

/**
  * @}
  */

  /** @defgroup SDIO_Group5 CE-ATA mode management functions
   *  @brief   CE-ATA mode management functions
   *
  @verbatim
   ===============================================================================
                CE-ATA mode management functions
   ===============================================================================

    This section provide functions allowing to program and read the CE-ATA card.

  @endverbatim
    * @{
    */

    /**
      * @brief  Enables or disables the command completion signal.
      * @param  newState: new state of command completion signal.
      *         This parameter can be: true or false.
      * @retval None
      */
void SDIO_CommandCompletionCmd(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) |= (1 << ENCMDCOMPL_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) &= ~(1 << ENCMDCOMPL_BitNumber);
    }
}

/**
  * @brief  Enables or disables the CE-ATA interrupt.
  * @param  newState: new state of CE-ATA interrupt.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_CEATAITCmd(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) |= (1 << NIEN_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) &= ~(1 << NIEN_BitNumber);
    }
}

/**
  * @brief  Sends CE-ATA command (CMD61).
  * @param  newState: new state of CE-ATA command.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_SendCEATACmd(bool newState) {
    if (newState) {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) |= (1 << ATACMD_BitNumber);
    }
    else {
        *reinterpret_cast<uint32_t*>(CMD_OFFSET) &= ~(1 << ATACMD_BitNumber);
    }
}

/**
  * @brief  Checks whether the specified SDMMC1 flag is set or not.
  * @param  SDIO_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg SDIO_FLAG_CCRCFAIL: Command response received (CRC check failed)
  *            @arg SDIO_FLAG_DCRCFAIL: Data block sent/received (CRC check failed)
  *            @arg SDIO_FLAG_CTIMEOUT: Command response timeout
  *            @arg SDIO_FLAG_DTIMEOUT: Data timeout
  *            @arg SDIO_FLAG_TXUNDERR: Transmit FIFO underrun error
  *            @arg SDIO_FLAG_RXOVERR:  Received FIFO overrun error
  *            @arg SDIO_FLAG_CMDREND:  Command response received (CRC check passed)
  *            @arg SDIO_FLAG_CMDSENT:  Command sent (no response required)
  *            @arg SDIO_FLAG_DATAEND:  Data end (data counter, SDIDCOUNT, is zero)
  *            @arg SDIO_FLAG_STBITERR: Start bit not detected on all data signals in wide bus mode.
  *            @arg SDIO_FLAG_DBCKEND:  Data block sent/received (CRC check passed)
  *            @arg SDIO_FLAG_CMDACT:   Command transfer in progress
  *            @arg SDIO_FLAG_TXACT:    Data transmit in progress
  *            @arg SDIO_FLAG_RXACT:    Data receive in progress
  *            @arg SDIO_FLAG_TXFIFOHE: Transmit FIFO Half Empty
  *            @arg SDIO_FLAG_RXFIFOHF: Receive FIFO Half Full
  *            @arg SDIO_FLAG_TXFIFOF:  Transmit FIFO full
  *            @arg SDIO_FLAG_RXFIFOF:  Receive FIFO full
  *            @arg SDIO_FLAG_TXFIFOE:  Transmit FIFO empty
  *            @arg SDIO_FLAG_RXFIFOE:  Receive FIFO empty
  *            @arg SDIO_FLAG_TXDAVL:   Data available in transmit FIFO
  *            @arg SDIO_FLAG_RXDAVL:   Data available in receive FIFO
  *            @arg SDIO_FLAG_SDIOIT:   SD I/O interrupt received
  *            @arg SDIO_FLAG_CEATAEND: CE-ATA command completion signal received for CMD61
  * @retval The new state of SDIO_FLAG (true or false).
  */
bool SDIO_GetFlagStatus(uint32_t SDIO_FLAG) {
    bool bitstatus = false;


