ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_SD.cpp
#define SD_HALFFIFO                     ((uint32_t)0x00000008)
#define SD_HALFFIFOBYTES                ((uint32_t)0x00000020)

#define SD_CCCC_LOCK_UNLOCK             ((uint32_t)0x00000080)
#define SD_CCCC_WRITE_PROT              ((uint32_t)0x00000040)
#define SD_CCCC_ERASE                   ((uint32_t)0x00000020)

#define SDIO_SEND_IF_COND               ((uint32_t)0x00000008)

static uint32_t CardType = SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;
static uint8_t SDSTATUS_Tab[16];
uint32_t StopCondition = 0;
SD_Error TransferError = SD_OK;
uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;
SD_CardInfo SDCardInfo;

static SD_Error CmdError(void);
static SD_Error CmdResp1Error(uint8_t cmd);
static SD_Error CmdResp7Error(void);
static SD_Error CmdResp3Error(void);
static SD_Error CmdResp2Error(void);
static SD_Error CmdResp6Error(uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus(FunctionalState newState);
static SD_Error FindSCR(uint16_t rca, uint32_t *pscr);

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Functions
  * @{
  */

  /**
    * @brief  DeInitializes the SDMMC1 interface.
    * @param  None
    * @retval None
    */
void SD_DeInit(void) {
    SDIO_DeInit();

    SD_PowerOFF();
}

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for data
  *         transfer).
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_Init(void) {
    SD_Error errorstatus = SD_OK;

    errorstatus = SD_PowerON();

    if (errorstatus != SD_OK) {
        /*!< CMD Response TimeOut (wait for CMDSENT flag) */
        return(errorstatus);
    }

    errorstatus = SD_InitializeCards();

    if (errorstatus != SD_OK) {
        /*!< CMD Response TimeOut (wait for CMDSENT flag) */
        return(errorstatus);
    }

    /*!< Configure the SDMMC1 peripheral */
    /*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
    /*!< on STM32F7xx devices, SDIOCLK is fixed to 48MHz */

    SDIO_Init(SDIO_TRANSFER_CLK_DIV, SDIO_ClockPowerSave_Disable, SDIO_ClockBypass_Disable, SDIO_ClockEdge_Rising, SDIO_BusWide_1b, SDIO_HardwareFlowControl_Disable);

    /*----------------- Read CSD/CID MSD registers ------------------*/
    errorstatus = SD_GetCardInfo(&SDCardInfo);

    if (errorstatus == SD_OK) {
        /*----------------- Select Card --------------------------------*/
        errorstatus = SD_SelectDeselect((uint32_t)(SDCardInfo.RCA << 16));
    }

    if (errorstatus == SD_OK) {
        errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b);
    }

    return(errorstatus);
}

/**
  * @brief  Gets the cuurent sd card data transfer status.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be:
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
SDTransferState SD_GetStatus(void) {
    SDCardState cardstate = SD_CARD_TRANSFER;

    cardstate = SD_GetState();

    if (cardstate == SD_CARD_TRANSFER) {
        return(SD_TRANSFER_OK);
    }
    else if (cardstate == SD_CARD_ERROR) {
        return (SD_TRANSFER_ERROR);
    }
    else {
        return(SD_TRANSFER_BUSY);
    }
}

/**
  * @brief  Returns the current card's state.
  * @param  None
  * @retval SDCardState: SD Card Error or SD Card Current State.
  */
SDCardState SD_GetState(void) {
    uint32_t resp1 = 0;

    if (SD_Detect() == SD_PRESENT) {
        if (SD_SendStatus(&resp1) != SD_OK) {
            return SD_CARD_ERROR;
        }
        else {
            return (SDCardState)((resp1 >> 9) & 0x0F);
        }
    }
    else {
        return SD_CARD_ERROR;
    }
}

/**
 * @brief  Detect if SD card is correctly plugged in the memory slot.
 * @param  None
 * @retval Return if SD is detected or not
 */
uint8_t SD_Detect(void) {
    uint8_t status = SD_PRESENT;

    return status;
}

/**
  * @brief  Enquires cards about their operating voltage and configures
  *   clock controls.
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_PowerON(void) {
    SD_Error errorstatus = SD_OK;
    uint32_t response = 0, count = 0, validvoltage = 0;
    uint32_t SDType = SD_STD_CAPACITY;

    /*!< Power ON Sequence -----------------------------------------------------*/
    /*!< Configure the SDMMC1 peripheral */
    /*!< SDIO_CK = SDIOCLK / (SDIO_INIT_CLK_DIV + 2) */
    /*!< on STM32F7xx devices, SDIOCLK is fixed to 48MHz */
    /*!< SDIO_CK for initialization should not exceed 400 KHz */
    SDIO_Init(SDIO_INIT_CLK_DIV, SDIO_ClockPowerSave_Disable, SDIO_ClockBypass_Disable, SDIO_ClockEdge_Rising, SDIO_BusWide_1b, SDIO_HardwareFlowControl_Disable);

    /*!< Set Power State to ON */
    SDIO_SetPowerState(SDIO_PowerState_ON);

    /*!< Enable SDMMC1 Clock */
    SDIO_ClockCmd(ENABLE);

    /*!< CMD0: GO_IDLE_STATE ---------------------------------------------------*/
    /*!< No CMD response required */
    SDIO_SendCommand(0, SD_CMD_GO_IDLE_STATE, SDIO_Response_No);

    errorstatus = CmdError();

    if (errorstatus != SD_OK) {
        /*!< CMD Response TimeOut (wait for CMDSENT flag) */
        return(errorstatus);
    }

    /*!< CMD8: SEND_IF_COND ----------------------------------------------------*/
    /*!< Send CMD8 to verify SD card interface operating condition */
    /*!< Argument: - [31:12]: Reserved (shall be set to '0')
                 - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
                 - [7:0]: Check Pattern (recommended 0xAA) */
                 /*!< CMD Response: R7 */
    SDIO_SendCommand(SD_CHECK_PATTERN, SDIO_SEND_IF_COND, SDIO_Response_Short);

    errorstatus = CmdResp7Error();

    if (errorstatus == SD_OK) {
        CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0; /*!< SD Card 2.0 */
        SDType = SD_HIGH_CAPACITY;
    }
    else {
        /*!< CMD55 */
        SDIO_SendCommand(0x00, SD_CMD_APP_CMD, SDIO_Response_Short);

        errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
    }
    /*!< CMD55 */
    SDIO_SendCommand(0x00, SD_CMD_APP_CMD, SDIO_Response_Short);

    errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

