ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_SD.cpp
    uint32_t scr[2] = { 0, 0 };

    if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED) {
        errorstatus = SD_LOCK_UNLOCK_FAILED;
        return(errorstatus);
    }

    /*!< Get SCR Register */
    errorstatus = FindSCR(RCA, scr);

    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /*!< If wide bus operation to be enabled */
    if (newState == ENABLE) {
        /*!< If requested card supports wide bus operation */
        if ((scr[1] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO) {
            /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
            SDIO_SendCommand((uint32_t)RCA << 16, SD_CMD_APP_CMD, SDIO_Response_Short);

            errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

            if (errorstatus != SD_OK) {
                return(errorstatus);
            }

            /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
            SDIO_SendCommand(0x2, SD_CMD_APP_SD_SET_BUSWIDTH, SDIO_Response_Short);

            errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

            if (errorstatus != SD_OK) {
                return(errorstatus);
            }
            return(errorstatus);
        }
        else {
            errorstatus = SD_REQUEST_NOT_APPLICABLE;
            return(errorstatus);
        }
    }   /*!< If wide bus operation to be disabled */
    else {
        /*!< If requested card supports 1 bit mode operation */
        if ((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO) {
            /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
            SDIO_SendCommand((uint32_t)RCA << 16, SD_CMD_APP_CMD, SDIO_Response_Short);


            errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

            if (errorstatus != SD_OK) {
                return(errorstatus);
            }

            /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
            SDIO_SendCommand(0x00, SD_CMD_APP_SD_SET_BUSWIDTH, SDIO_Response_Short);

            errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

            if (errorstatus != SD_OK) {
                return(errorstatus);
            }

            return(errorstatus);
        }
        else {
            errorstatus = SD_REQUEST_NOT_APPLICABLE;
            return(errorstatus);
        }
    }
}

/**
  * @brief  Find the SD card SCR register value.
  * @param  rca: selected card address.
  * @param  pscr: pointer to the buffer that will contain the SCR value.
  * @retval SD_Error: SD Card Error code.
  */
static SD_Error FindSCR(uint16_t rca, uint32_t *pscr) {
    uint32_t index = 0;
    SD_Error errorstatus = SD_OK;
    uint32_t tempscr[2] = { 0, 0 };

    /*!< Set Block Size To 8 Bytes */
    /*!< Send CMD55 APP_CMD with argument as card's RCA */
    SDIO_SendCommand(0x8, SD_CMD_SET_BLOCKLEN, SDIO_Response_Short);

    errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    /*!< Send CMD55 APP_CMD with argument as card's RCA */
    SDIO_SendCommand((uint32_t)RCA << 16, SD_CMD_APP_CMD, SDIO_Response_Short);

    errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    SDIO_DataConfig(8, SDIO_DataBlockSize_8b, SDIO_TransferDir_ToSDIO);


    /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
    SDIO_SendCommand(0x0, SD_CMD_SD_APP_SEND_SCR, SDIO_Response_Short);

    errorstatus = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);

    if (errorstatus != SD_OK) {
        return(errorstatus);
    }

    while (!(SDMMC1->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
        if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) {
            *(tempscr + index) = SDIO_ReadData();
            index++;
        }
    }

    if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET) {
        SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
        return(SD_DATA_TIMEOUT);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET) {
        SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
        return(SD_DATA_CRC_FAIL);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET) {
        SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
        return(SD_RX_OVERRUN);
    }
    else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET) {
        SDIO_ClearFlag(SDIO_FLAG_STBITERR);
        return(SD_START_BIT_ERR);
    }

    /*!< Clear all the static flags */
    SDIO_ClearFlag(SDIO_STATIC_FLAGS);

    *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

    *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

    return(errorstatus);
}

// stm32f7

#define STM32F7_SD_SECTOR_SIZE 512
#define STM32F7_SD_TIMEOUT 5000000
#define TOTAL_SDCARD_CONTROLLERS 1

static TinyCLR_SdCard_Controller sdCardControllers[TOTAL_SDCARD_CONTROLLERS];
static TinyCLR_Api_Info sdCardApi[TOTAL_SDCARD_CONTROLLERS];

struct SdCardState {
    int32_t controllerIndex;
    size_t  sectorCount;

    size_t  *sectorSizes;
};

static const STM32F7_Gpio_Pin sdCardData0Pins[] = STM32F7_SD_DATA0_PINS;
static const STM32F7_Gpio_Pin sdCardData1Pins[] = STM32F7_SD_DATA1_PINS;
static const STM32F7_Gpio_Pin sdCardData2Pins[] = STM32F7_SD_DATA2_PINS;
static const STM32F7_Gpio_Pin sdCardData3Pins[] = STM32F7_SD_DATA3_PINS;
static const STM32F7_Gpio_Pin sdCardClkPins[] = STM32F7_SD_CLK_PINS;
static const STM32F7_Gpio_Pin sdCardCmdPins[] = STM32F7_SD_CMD_PINS;

static SdCardState sdCardStates[TOTAL_SDCARD_CONTROLLERS];

const TinyCLR_Api_Info* STM32F7_SdCard_GetApi() {
    for (auto i = 0; i < TOTAL_SDCARD_CONTROLLERS; i++) {
        sdCardControllers[i].ApiInfo = &sdCardApi[i];

        sdCardControllers[i].Acquire = &STM32F7_SdCard_Acquire;
        sdCardControllers[i].Release = &STM32F7_SdCard_Release;

        sdCardControllers[i].WriteSectors = &STM32F7_SdCard_WriteSector;
        sdCardControllers[i].ReadSectors = &STM32F7_SdCard_ReadSector;
        sdCardControllers[i].EraseSectors = &STM32F7_SdCard_EraseSector;
        sdCardControllers[i].IsSectorErased = &STM32F7_SdCard_IsSectorErased;
        sdCardControllers[i].GetSectorMap = &STM32F7_SdCard_GetSectorMap;

        sdCardApi[i].Author = "GHI Electronics, LLC";
        sdCardApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.STM32F7.SdCardController";
        sdCardApi[i].Type = TinyCLR_Api_Type::SdCardController;
        sdCardApi[i].Version = 0;
        sdCardApi[i].Implementation = &sdCardControllers[i];
        sdCardApi[i].State = &sdCardStates[i];

