ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_SD.cpp
        sdCardStates[i].controllerIndex = i;
    }

    return (const TinyCLR_Api_Info*)&sdCardApi;
}

TinyCLR_Result STM32F7_SdCard_Acquire(const TinyCLR_SdCard_Controller* self) {
    auto driver = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    auto controllerIndex = driver->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    if (!STM32F7_GpioInternal_OpenPin(d0.number)
        || !STM32F7_GpioInternal_OpenPin(d1.number)
        || !STM32F7_GpioInternal_OpenPin(d2.number)
        || !STM32F7_GpioInternal_OpenPin(d3.number)
        || !STM32F7_GpioInternal_OpenPin(clk.number)
        || !STM32F7_GpioInternal_OpenPin(cmd.number)
        )
        return TinyCLR_Result::SharingViolation;

    STM32F7_GpioInternal_ConfigurePin(d0.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, d0.alternateFunction);
    STM32F7_GpioInternal_ConfigurePin(d1.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, d1.alternateFunction);
    STM32F7_GpioInternal_ConfigurePin(d2.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, d2.alternateFunction);
    STM32F7_GpioInternal_ConfigurePin(d3.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, d3.alternateFunction);
    STM32F7_GpioInternal_ConfigurePin(clk.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::None, clk.alternateFunction);
    STM32F7_GpioInternal_ConfigurePin(cmd.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, cmd.alternateFunction);

    RCC->APB2ENR |= (1 << 11);

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    driver->sectorSizes = (size_t*)memoryProvider->Allocate(memoryProvider, sizeof(size_t));

    SD_DeInit();

    return SD_Init() == SD_OK ? TinyCLR_Result::Success : TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F7_SdCard_Release(const TinyCLR_SdCard_Controller* self) {
    auto driver = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    auto controllerIndex = driver->controllerIndex;

    auto d0 = sdCardData0Pins[controllerIndex];
    auto d1 = sdCardData1Pins[controllerIndex];
    auto d2 = sdCardData2Pins[controllerIndex];
    auto d3 = sdCardData3Pins[controllerIndex];
    auto clk = sdCardClkPins[controllerIndex];
    auto cmd = sdCardCmdPins[controllerIndex];

    SD_DeInit();

    RCC->APB2ENR &= ~(1 << 11);

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    memoryProvider->Free(memoryProvider, driver->sectorSizes);

    STM32F7_GpioInternal_ClosePin(d0.number);
    STM32F7_GpioInternal_ClosePin(d1.number);
    STM32F7_GpioInternal_ClosePin(d2.number);
    STM32F7_GpioInternal_ClosePin(d3.number);
    STM32F7_GpioInternal_ClosePin(clk.number);
    STM32F7_GpioInternal_ClosePin(cmd.number);

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_SdCard_WriteSector(const TinyCLR_SdCard_Controller* self, uint64_t sector, size_t& count, const uint8_t* data, int32_t timeout) {
    int32_t index = 0;

    int32_t to;

    auto sectorCount = count;

    auto sectorNum = sector;

    uint8_t* pData = (uint8_t*)data;

    while (sectorCount) {
        to = timeout;

        while (SD_GetStatus() != SD_TRANSFER_OK && to--) {
            STM32F7_Time_Delay(nullptr, 1);
        }

        if (to > 0 && SD_WriteBlock(&pData[index], sectorNum * STM32F7_SD_SECTOR_SIZE, STM32F7_SD_SECTOR_SIZE) == SD_OK) {
            index += STM32F7_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            SD_StopTransfer();
        }

        if (!to) {
            return TinyCLR_Result::TimedOut;
        }
    }

    return TinyCLR_Result::Success;

}

TinyCLR_Result STM32F7_SdCard_ReadSector(const TinyCLR_SdCard_Controller* self, uint64_t sector, size_t& count, uint8_t* data, int32_t timeout) {
    int32_t index = 0;

    int32_t to;

    auto sectorCount = count;

    auto sectorNum = sector;

    while (sectorCount) {
        to = timeout;

        while (SD_GetStatus() != SD_TRANSFER_OK && to--) {
            STM32F7_Time_Delay(nullptr, 1);
        }

        if (to > 0 && SD_ReadBlock(&data[index], sectorNum * STM32F7_SD_SECTOR_SIZE, STM32F7_SD_SECTOR_SIZE) == SD_OK) {
            index += STM32F7_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            SD_StopTransfer();
        }

        if (!to) {
            return TinyCLR_Result::TimedOut;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_SdCard_IsSectorErased(const TinyCLR_SdCard_Controller* self, uint64_t sector, bool& erased) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_SdCard_EraseSector(const TinyCLR_SdCard_Controller* self, uint64_t sector, size_t& count, int32_t timeout) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_SdCard_GetSectorMap(const TinyCLR_SdCard_Controller* self, const size_t*& sizes, size_t& count, bool& isUniform) {
    auto driver = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    driver->sectorSizes[0] = STM32F7_SD_SECTOR_SIZE;

    sizes = driver->sectorSizes;
    count = SDCardInfo.CardCapacity / STM32F7_SD_SECTOR_SIZE;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_SdCard_Reset() {
    return TinyCLR_Result::Success;
}
#endif // INCLUDE_SD